#+title: Config
#+PROPERTY: header-args emacs-lisp :tangle yes

#+BEGIN_SRC emacs-lisp
 (setq
 doom-font (font-spec :family "Fantasque Sans Mono Nerd" :size 18 :weight 'regular)
 doom-theme 'doom-one
 display-line-numbers-type t

 projectile-project-search-path '("~/code/" "~/code/mopho/"))

;; Mermaid setup
(use-package! ob-mermaid
  :config
  (setq ob-mermaid-cli-path "mmdc")) ; adjust path

;; PlantUML setup
(use-package! plantuml-mode
  :config
  (setq plantuml-executable-path "plantuml")
  (setq plantuml-default-exec-mode 'executable))

;; Excalidraw setup
(use-package! org-excalidraw)

;; Enable babel languages
(org-babel-do-load-languages
 'org-babel-load-languages
 '((mermaid . t)
   (plantuml . t)
   (dot . t)))

(after! org
  (setq org-directory "~/org"))

#+END_SRC

#+RESULTS:
: ~/org
